; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	infrared1 - mode
	image2 - mode
	Star1 - direction
	Star3 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star2)
	(supports instrument2 image2)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 181)
	(= (data Phenomenon4 image0) 24)
	(= (data Planet5 image0) 128)
	(= (data Planet6 image0) 23)
	(= (data Star7 image0) 263)
	(= (data Phenomenon8 image0) 192)
	(= (data Star9 image0) 282)
	(= (data Planet10 image0) 234)
	(= (data Planet11 image0) 114)
	(= (data Phenomenon4 infrared1) 167)
	(= (data Planet5 infrared1) 77)
	(= (data Planet6 infrared1) 180)
	(= (data Star7 infrared1) 279)
	(= (data Phenomenon8 infrared1) 201)
	(= (data Star9 infrared1) 237)
	(= (data Planet10 infrared1) 154)
	(= (data Planet11 infrared1) 231)
	(= (data Phenomenon4 image2) 121)
	(= (data Planet5 image2) 223)
	(= (data Planet6 image2) 99)
	(= (data Star7 image2) 64)
	(= (data Phenomenon8 image2) 76)
	(= (data Star9 image2) 89)
	(= (data Planet10 image2) 169)
	(= (data Planet11 image2) 113)
	(= (slew_time Star1 Star0) 21.2)
	(= (slew_time Star0 Star1) 21.2)
	(= (slew_time Star3 Star0) 7.954)
	(= (slew_time Star0 Star3) 7.954)
	(= (slew_time Star3 Star1) 14.42)
	(= (slew_time Star1 Star3) 14.42)
	(= (slew_time Star3 Star2) 46.79)
	(= (slew_time Star2 Star3) 46.79)
	(= (slew_time Star2 Star0) 19.77)
	(= (slew_time Star0 Star2) 19.77)
	(= (slew_time Star2 Star1) 54.03)
	(= (slew_time Star1 Star2) 54.03)
	(= (slew_time Phenomenon4 Star0) 49.68)
	(= (slew_time Star0 Phenomenon4) 49.68)
	(= (slew_time Phenomenon4 Star1) 29.94)
	(= (slew_time Star1 Phenomenon4) 29.94)
	(= (slew_time Phenomenon4 Star2) 52)
	(= (slew_time Star2 Phenomenon4) 52)
	(= (slew_time Phenomenon4 Star3) 7.237)
	(= (slew_time Star3 Phenomenon4) 7.237)
	(= (slew_time Planet5 Star0) 39.36)
	(= (slew_time Star0 Planet5) 39.36)
	(= (slew_time Planet5 Star1) 49.05)
	(= (slew_time Star1 Planet5) 49.05)
	(= (slew_time Planet5 Star2) 25.66)
	(= (slew_time Star2 Planet5) 25.66)
	(= (slew_time Planet5 Star3) 14.28)
	(= (slew_time Star3 Planet5) 14.28)
	(= (slew_time Planet5 Phenomenon4) 26.66)
	(= (slew_time Phenomenon4 Planet5) 26.66)
	(= (slew_time Planet6 Star0) 13.51)
	(= (slew_time Star0 Planet6) 13.51)
	(= (slew_time Planet6 Star1) 22.39)
	(= (slew_time Star1 Planet6) 22.39)
	(= (slew_time Planet6 Star2) 8.677)
	(= (slew_time Star2 Planet6) 8.677)
	(= (slew_time Planet6 Star3) 56.85)
	(= (slew_time Star3 Planet6) 56.85)
	(= (slew_time Planet6 Phenomenon4) 3.656)
	(= (slew_time Phenomenon4 Planet6) 3.656)
	(= (slew_time Planet6 Planet5) 6.391)
	(= (slew_time Planet5 Planet6) 6.391)
	(= (slew_time Star7 Star0) 21.91)
	(= (slew_time Star0 Star7) 21.91)
	(= (slew_time Star7 Star1) 19.27)
	(= (slew_time Star1 Star7) 19.27)
	(= (slew_time Star7 Star2) 9.307)
	(= (slew_time Star2 Star7) 9.307)
	(= (slew_time Star7 Star3) 45.83)
	(= (slew_time Star3 Star7) 45.83)
	(= (slew_time Star7 Phenomenon4) 19.74)
	(= (slew_time Phenomenon4 Star7) 19.74)
	(= (slew_time Star7 Planet5) 17.39)
	(= (slew_time Planet5 Star7) 17.39)
	(= (slew_time Star7 Planet6) 23.52)
	(= (slew_time Planet6 Star7) 23.52)
	(= (slew_time Phenomenon8 Star0) 23.14)
	(= (slew_time Star0 Phenomenon8) 23.14)
	(= (slew_time Phenomenon8 Star1) 56.73)
	(= (slew_time Star1 Phenomenon8) 56.73)
	(= (slew_time Phenomenon8 Star2) 25.32)
	(= (slew_time Star2 Phenomenon8) 25.32)
	(= (slew_time Phenomenon8 Star3) 34.35)
	(= (slew_time Star3 Phenomenon8) 34.35)
	(= (slew_time Phenomenon8 Phenomenon4) 20.57)
	(= (slew_time Phenomenon4 Phenomenon8) 20.57)
	(= (slew_time Phenomenon8 Planet5) 0.2995)
	(= (slew_time Planet5 Phenomenon8) 0.2995)
	(= (slew_time Phenomenon8 Planet6) 49.28)
	(= (slew_time Planet6 Phenomenon8) 49.28)
	(= (slew_time Phenomenon8 Star7) 16.95)
	(= (slew_time Star7 Phenomenon8) 16.95)
	(= (slew_time Star9 Star0) 39.19)
	(= (slew_time Star0 Star9) 39.19)
	(= (slew_time Star9 Star1) 71.69)
	(= (slew_time Star1 Star9) 71.69)
	(= (slew_time Star9 Star2) 50.83)
	(= (slew_time Star2 Star9) 50.83)
	(= (slew_time Star9 Star3) 4.959)
	(= (slew_time Star3 Star9) 4.959)
	(= (slew_time Star9 Phenomenon4) 0.00253)
	(= (slew_time Phenomenon4 Star9) 0.00253)
	(= (slew_time Star9 Planet5) 8.148)
	(= (slew_time Planet5 Star9) 8.148)
	(= (slew_time Star9 Planet6) 57.73)
	(= (slew_time Planet6 Star9) 57.73)
	(= (slew_time Star9 Star7) 39.85)
	(= (slew_time Star7 Star9) 39.85)
	(= (slew_time Star9 Phenomenon8) 60.18)
	(= (slew_time Phenomenon8 Star9) 60.18)
	(= (slew_time Planet10 Star0) 29.65)
	(= (slew_time Star0 Planet10) 29.65)
	(= (slew_time Planet10 Star1) 50)
	(= (slew_time Star1 Planet10) 50)
	(= (slew_time Planet10 Star2) 1.725)
	(= (slew_time Star2 Planet10) 1.725)
	(= (slew_time Planet10 Star3) 87.48)
	(= (slew_time Star3 Planet10) 87.48)
	(= (slew_time Planet10 Phenomenon4) 31.38)
	(= (slew_time Phenomenon4 Planet10) 31.38)
	(= (slew_time Planet10 Planet5) 3.002)
	(= (slew_time Planet5 Planet10) 3.002)
	(= (slew_time Planet10 Planet6) 25.7)
	(= (slew_time Planet6 Planet10) 25.7)
	(= (slew_time Planet10 Star7) 8.243)
	(= (slew_time Star7 Planet10) 8.243)
	(= (slew_time Planet10 Phenomenon8) 62.57)
	(= (slew_time Phenomenon8 Planet10) 62.57)
	(= (slew_time Planet10 Star9) 33.52)
	(= (slew_time Star9 Planet10) 33.52)
	(= (slew_time Planet11 Star0) 11.95)
	(= (slew_time Star0 Planet11) 11.95)
	(= (slew_time Planet11 Star1) 51.76)
	(= (slew_time Star1 Planet11) 51.76)
	(= (slew_time Planet11 Star2) 60.2)
	(= (slew_time Star2 Planet11) 60.2)
	(= (slew_time Planet11 Star3) 1.901)
	(= (slew_time Star3 Planet11) 1.901)
	(= (slew_time Planet11 Phenomenon4) 2.97)
	(= (slew_time Phenomenon4 Planet11) 2.97)
	(= (slew_time Planet11 Planet5) 53.97)
	(= (slew_time Planet5 Planet11) 53.97)
	(= (slew_time Planet11 Planet6) 7.034)
	(= (slew_time Planet6 Planet11) 7.034)
	(= (slew_time Planet11 Star7) 58.14)
	(= (slew_time Star7 Planet11) 58.14)
	(= (slew_time Planet11 Phenomenon8) 0.4125)
	(= (slew_time Phenomenon8 Planet11) 0.4125)
	(= (slew_time Planet11 Star9) 9.449)
	(= (slew_time Star9 Planet11) 9.449)
	(= (slew_time Planet11 Planet10) 24.87)
	(= (slew_time Planet10 Planet11) 24.87)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon4 image0)
	(have_image Planet5 image2)
	(have_image Star9 image2)
	(have_image Planet10 image0)
	(have_image Planet11 image2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 181 to 174.609, (fuel-used) from 0 to 6.391
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 174.609 to 171.607, (fuel-used) from 6.391 to 9.393
   goals met: 0 of 5
4. (turn_to satellite0 star2 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 171.607 to 169.882, (fuel-used) from 9.393 to 11.118
   goals met: 0 of 5
5. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 0 of 5
6. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 5
7. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 5
8. (turn_to satellite0 star9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 169.882 to 119.052, (fuel-used) from 11.118 to 61.948
   goals met: 0 of 5
9. (take_image satellite0 star9 instrument2 image2)
   added: (have_image star9 image2)
   changed: (data_capacity satellite0) from 1000 to 911, (data-stored) from 0 to 89
   goals met: 1 of 5
10. (turn_to satellite0 phenomenon4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 119.052 to 119.049, (fuel-used) from 61.948 to 61.9505
   goals met: 1 of 5
11. (take_image satellite0 phenomenon4 instrument2 image0)
   added: (have_image phenomenon4 image0)
   changed: (data_capacity satellite0) from 911 to 887, (data-stored) from 89 to 113
   goals met: 2 of 5
12. (turn_to satellite0 planet11 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 119.049 to 116.079, (fuel-used) from 61.9505 to 64.9205
   goals met: 2 of 5
13. (take_image satellite0 planet11 instrument2 image2)
   added: (have_image planet11 image2)
   changed: (data_capacity satellite0) from 887 to 774, (data-stored) from 113 to 226
   goals met: 3 of 5
14. (turn_to satellite0 planet5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 116.079 to 62.1095, (fuel-used) from 64.9205 to 118.891
   goals met: 3 of 5
15. (take_image satellite0 planet5 instrument2 image2)
   added: (have_image planet5 image2)
   changed: (data_capacity satellite0) from 774 to 551, (data-stored) from 226 to 449
   goals met: 4 of 5
16. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 62.1095 to 59.1075, (fuel-used) from 118.891 to 121.893
   goals met: 4 of 5
17. (take_image satellite0 planet10 instrument2 image0)
   added: (have_image planet10 image0)
   changed: (data_capacity satellite0) from 551 to 317, (data-stored) from 449 to 683
   goals met: 5 of 5
